/*
 * CFile1.c
 *
 * Created: 05.01.2014 16:34:39
 *  Author: cc
 */ 

#include "Port.h"
#include <avr/io.h>


void Port_init(void)
{
	#if defined(__AVR_ATmega32__)
		// Port A
		PORTA = 0b00000000;
		//		  ||||||||--->	P0:
		//		  |||||||---->	P1:
		//		  ||||||----->	P2:
		//		  |||||------>	P3:
		//		  ||||------->	P4:
		//		  |||-------->	P5:
		//		  ||--------->	P6:
		//		  |---------->	P7:
		DDRA = 0b00000000;
		//		 ||||||||--->	P0: (I) not used (ADC0)
		//		 |||||||---->	P1: (I) not used (ADC1)
		//		 ||||||----->	P2: (I) not used (ADC2)
		//		 |||||------>	P3: (I) not used (ADC3)
		//		 ||||------->	P4: (I) not used (ADC4)
		//		 |||-------->	P5: (I) not used (ADC5)
		//		 ||--------->	P6: (I) not used (ADC6)
		//		 |---------->	P7: (I) not used (ADC7)
	#endif
	// Port B
	PORTB = 0b00000000;
	//		  ||||||||--->	P0:
	//		  |||||||---->	P1:
	//		  ||||||----->	P2:
	//		  |||||------>	P3:
	//		  ||||------->	P4:
	//		  |||-------->	P5:
	//		  ||--------->	P6:
	//		  |---------->	P7:
	DDRB = 0b00000000;
	//		 ||||||||--->	P0: (I) not used (XCK/T0)
	//		 |||||||---->	P1: (I) not used (T1)
	//		 ||||||----->	P2: (I) not used (INT2/AIN0)
	//		 |||||------>	P3: (I) not used (OC0/AIN1)
	//		 ||||------->	P4: (I) not used (!CS)
	//		 |||-------->	P5: (I) not used (MOSI)
	//		 ||--------->	P6: (I) not used (MISO)
	//		 |---------->	P7: (I) not used (SCK)

		
	// Port C
	PORTC = 0b00000000;
	//		  ||||||||--->	P0:
	//		  |||||||---->	P1:
	//		  ||||||----->	P2:
	//		  |||||------>	P3:
	//		  ||||------->	P4:
	//		  |||-------->	P5:
	//		  ||--------->	P6:
	//		  |---------->	P7:
	DDRC = 0b00000000;
	//		 ||||||||--->	P0: (I) not used	(SCL)
	//		 |||||||---->	P1: (I) not used	(SDA)
	//		 ||||||----->	P2: (I) not used	(JTAG_TCK)
	//		 |||||------>	P3: (I) not used	(JTAG_TMS)
	//		 ||||------->	P4: (I) not used	(JTAG_TDO)
	//		 |||-------->	P5: (I) not used	(JTAG_TDI)
	//		 ||--------->	P6: (I) not used	(TOSC1)
	//		 |---------->	P7: (I) not used	(TOSC2)
	
	// Port D
	PORTD = 0b00000000;
	//		  ||||||||--->	P0:
	//		  |||||||---->	P1:
	//		  ||||||----->	P2:
	//		  |||||------>	P3:
	//		  ||||------->	P4:
	//		  |||-------->	P5:
	//		  ||--------->	P6: 
	//		  |---------->	P7: 
	DDRD = 0b11100010;
	//		 ||||||||--->	P0: (I) µC RxD		(RXD)
	//		 |||||||---->	P1: (O) µC TxD		(TXD)
	//		 ||||||----->	P2: (I) not used	(INT0)
	//		 |||||------>	P3: (I) not used	(INT1)
	//		 ||||------->	P4: (I) not used	(OC1B)
	//		 |||-------->	P5: (O) servo		(OC1A)
	//		 ||--------->	P6: (O) Name0		(ICP1)
	//		 |---------->	P7: (O) Name1		(OC2)
}